#include <stdio.h>
/*6. Напиши програм кој внесува петцифрен број, ги распределува сите цифри на бројот во посебни променливи и ги печати секоја од цифрите со растојание една од дуга од три празни места. 
Прмер. Нека корисникот внел 42139. Програмот треба да испечати:
4   2   1   3   9
      */

int main(void)
{
    printf("Vnesi petcifren broj\n");
    int broj;
    scanf("%d",&broj);
    printf("%d ",broj/10000);
    printf("%d ",(broj/1000)%10);
    printf("%d ",(broj/100)%10);
    printf("%d ",(broj%100)/10);
    printf("%d ",broj%10);


    return 0;
}