/*1.	Напиши програм кој конвертира целобројни фарантхајтови температури од 0-212 степени во децимални цезлиусови температури 
со 3 цифри прецизност. Да се користи формулата:
celsius = 5.0 /9.0 * (fahrenheit - 32).
Излезот да се испечати во две десно порамнети колони од по 10 карактери, 
а целзиусовите вредности треба да се предводени од знак и за позитивни и за негативни вредности.
*/
#include <stdio.h>

int main(void){


int fahrenheit;
printf("Vnesi farenthajtovi stepeni od 0-212: \n");
scanf("%d",&fahrenheit);

float celsius= 5.0/9.0 *(fahrenheit-32);

printf("\t %10.3f\t",celsius);

    return 0;
}