/* 
3. Да се пронајдат на Интернет кодовите за бројки и букви во Морзеовата азбука. 
Да се напише програм кој чита текст фраза и ја дава нејзината вредност во Морзеовата азбука.
 Да се направи и друга функција на која и се предава Морзеов текст, а треба како резултат да се добие текст фраза во говорен јазик.
 */


/*char *morse[36] = {".-","-...","-.-.","-..",".","..-.","--.","....",
"..",".---","-.-",".-..","--","-.","---",".--.","--.-",".-.","...",
"-","..-","...-",".--","-..-","-.--","--..","-----",".----","..---",
"...--","....-",".....","-....","--...","---..","----."};
*/
#include <stdio.h>
#include <string.h>
#include <ctype.h>
static const char *alpha[] = {{
    ".-",  "A"},
   { "-...", "B"},
    {"-.-.", "C"},
    {"-..",  "D"},
    {".",   "E"},
    {"..-.", "F"},
    {"--.",  "G"},
    {"....", "H"},
    {"..",  "I"},
    {".---", "J"},
    {"-.-",  "K"},
    {".-..", "L"},
    {"--",   "M"},
    {"-.",   "N"},
    {"---",  "O"},
    {".--.", "P"},
    {"--.-", "Q"},
    {".-.",  "R"},
    {"...",  "S"},
    {"-",   "T"},
    {"..-",  "U"},
    {"...-", "V"},
    {".--",  "W"},
    {"-..-", "X"},
    {"-.--", "Y"},
    {"--..", "Z"
}};
int main(){
char string[50];
char *text;
printf("Input a text");
gets(string);
text=strtok(string," ");

while(text){
    for(int i=0;i<sizeof(alpha);++i){
        if(!strcmp(text,alpha[i])){}
    }
    text=strtok(NULL," ");
}


    return 0;
}